       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.

       PROCEDURE DIVISION.
           DISPLAY "RoboRecycle Systems"
           DISPLAY "Batch-Initialisierung gestartet..."
           STOP RUN.
